<?php

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------
return [
    // 默认缓存驱动
    'default' => 'file',

    // 缓存连接方式配置
    'stores'  => [
        'file' => [
            // 驱动方式
            'type'       => 'File',
            // 缓存保存目录
            'path'       => '',
            // 缓存前缀
            'prefix'     => 'EA8TP', // 主要是为了区分不同版本安装后数据的残留
            // 缓存有效期 0表示永久缓存
            'expire'     => 0,
            // 缓存标签前缀
            'tag_prefix' => 'tag:',
            // 序列化机制 例如 ['serialize', 'unserialize']
            'serialize'  => [],
        ],
        'redis' => [
            // 驱动方式
            'type'       => 'Redis',
            // 服务器地址
            'host'       => '127.0.0.1',
            // 端口
            'port'       => 6379,
            // 密码
            'password'   => env('REDIS_PASSWORD', ''),
            // 数据库
            'select'     => 0,
            // 缓存前缀
            'prefix'     => 'EA8_',
            // 缓存有效期 0表示永久缓存
            'expire'     => 0,
            // 超时时间
            'timeout'    => 0,
            // 是否序列化
            'serialize'  => true,
        ],
        // 更多的缓存连接
    ],
];
